# Many to Many Relationships

Think about a Human Resources database for a large company

* Departments
* Employees
* Titles
* Managers
* Salaries

## Basic LDS

![](company_simple.png)

## Eliminating Many-Many relationship

![](company_intermediate.png)

## From Model to Table

```
employees=# \d departments
          Table "public.departments"
  Column   |         Type          | Modifiers
-----------+-----------------------+-----------
 dept_no   | character(4)          | not null
 dept_name | character varying(40) | not null


employees=# \d dept_emp
       Table "public.dept_emp"
  Column   |     Type     | Modifiers
-----------+--------------+-----------
 emp_no    | integer      | not null
 dept_no   | character(4) | not null
 from_date | date         | not null
 to_date   | date         | not null


employees=# \d employees
            Table "public.employees"
   Column   |         Type          | Modifiers
------------+-----------------------+-----------
 emp_no     | integer               | not null
 birth_date | date                  | not null
 first_name | character varying(14) | not null
 last_name  | character varying(16) | not null
 gender     | character varying(1)  | not null
 hire_date  | date                  | not null

```

## The Final LDS

![](company_advanced.png)

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
%load_ext sql

In [3]:
%sql postgresql://yasiro01:@localhost/employees

'Connected: yasiro01@employees'

In [6]:
%%sql

select *
from departments , dept_emp , employees , salaries , titles
limit 10

10 rows affected.

[('d001', 'Marketing', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d002', 'Finance', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d003', 'Human Resources', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d004', 'Production', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d005', 'Development', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d006', 'Quality Management', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d007', 'Sales', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d008', 'Research', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d009', 'Customer Service', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 ('d001', 'Marketing', 10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 10001, 62102, datetime.date(1987, 6, 26), datetime.date(1988, 6, 25), 10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))]

In [4]:
%%sql

select *
from departments natural join dept_emp natural join employees natural join salaries natural join titles
limit 10

10 rows affected.

[(13021, datetime.date(1991, 10, 18), datetime.date(1992, 3, 19), 'd005', 'Development', datetime.date(1957, 3, 10), 'Yurii', 'Schaap', 'M', datetime.date(1991, 10, 18), 45553, 'Senior Engineer'),
 (15083, datetime.date(1996, 5, 30), datetime.date(1997, 4, 19), 'd006', 'Quality Management', datetime.date(1958, 11, 24), 'Denis', 'Nicolson', 'M', datetime.date(1994, 3, 2), 68084, 'Senior Engineer'),
 (17091, datetime.date(1992, 2, 11), datetime.date(1992, 3, 20), 'd004', 'Production', datetime.date(1958, 11, 8), 'Gunilla', 'Merkl', 'F', datetime.date(1988, 1, 30), 48099, 'Assistant Engineer'),
 (19343, datetime.date(1986, 6, 2), datetime.date(1986, 11, 18), 'd007', 'Sales', datetime.date(1953, 10, 12), 'Heping', 'Hempstead', 'F', datetime.date(1986, 6, 2), 44351, 'Staff'),
 (20910, datetime.date(1995, 12, 9), datetime.date(1996, 1, 7), 'd007', 'Sales', datetime.date(1963, 8, 6), 'Chenyi', 'Kavraki', 'M', datetime.date(1993, 8, 14), 76194, 'Senior Staff'),
 (25281, datetime.date(1993, 7, 27), datetime.date(1993, 11, 8), 'd003', 'Human Resources', datetime.date(1956, 11, 10), 'Fumiyo', 'Delgrande', 'F', datetime.date(1991, 6, 7), 47478, 'Staff'),
 (27762, datetime.date(1991, 4, 9), datetime.date(1991, 8, 14), 'd007', 'Sales', datetime.date(1954, 6, 6), 'Boalin', 'Griswold', 'F', datetime.date(1988, 6, 5), 57852, 'Staff'),
 (28155, datetime.date(1995, 10, 9), datetime.date(1996, 8, 22), 'd002', 'Finance', datetime.date(1961, 9, 1), 'Jianwen', 'Marsiglia', 'F', datetime.date(1990, 1, 11), 74637, 'Staff'),
 (31972, datetime.date(1993, 1, 21), datetime.date(1994, 1, 10), 'd005', 'Development', datetime.date(1952, 12, 18), 'Yifei', 'Kawashimo', 'F', datetime.date(1990, 5, 12), 68011, 'Senior Engineer'),
 (32671, datetime.date(1998, 11, 5), datetime.date(1998, 11, 12), 'd003', 'Human Resources', datetime.date(1963, 3, 31), 'Atreye', 'Tetzlaff', 'M', datetime.date(1996, 12, 22), 40000, 'Staff')]

## How many employees currently work in various departments?

In [9]:
%%sql

select dept_name, count(*)
from departments natural join dept_emp
group by dept_name
order by count

9 rows affected.

[('Finance', 17346),
 ('Human Resources', 17786),
 ('Quality Management', 20117),
 ('Marketing', 20211),
 ('Research', 21126),
 ('Customer Service', 23580),
 ('Sales', 52245),
 ('Production', 73485),
 ('Development', 85707)]

In [17]:
%%sql

select count(*)
from departments natural join dept_emp
where now() < to_date

1 rows affected.

[(240124,)]

1. **Note:** the ``now()`` function is just a convenience for manually entereing the current date
2. **Note:** we can use aggregates without a grouby, realizing that said aggregate applies to the whole result

## Find all managers of the *Marketing* department

In [18]:
%%sql

select first_name, last_name, from_date, to_date
from departments natural join dept_manager natural join employees
where dept_name = 'Marketing';

2 rows affected.

[('Margareta', 'Markovitch', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 ('Vishwani', 'Minakawa', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))]

In [19]:
%%sql

select first_name, last_name, from_date, to_date
from departments natural join employees natural join dept_manager
where dept_name = 'Marketing';

2 rows affected.

[('Margareta', 'Markovitch', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 ('Vishwani', 'Minakawa', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))]

## Find *current* manager of every department

In [21]:
%%sql

select dept_name, first_name, last_name, from_date
from departments natural join dept_manager natural join employees
where now() < to_date
order by dept_name

9 rows affected.

[('Customer Service', 'Yuchang', 'Weedman', datetime.date(1996, 1, 3)),
 ('Development', 'Leon', 'DasSarma', datetime.date(1992, 4, 25)),
 ('Finance', 'Isamu', 'Legleitner', datetime.date(1989, 12, 17)),
 ('Human Resources', 'Karsten', 'Sigstam', datetime.date(1992, 3, 21)),
 ('Marketing', 'Vishwani', 'Minakawa', datetime.date(1991, 10, 1)),
 ('Production', 'Oscar', 'Ghazalie', datetime.date(1996, 8, 30)),
 ('Quality Management', 'Dung', 'Pesch', datetime.date(1994, 6, 28)),
 ('Research', 'Hilary', 'Kambil', datetime.date(1991, 4, 8)),
 ('Sales', 'Hauke', 'Zhang', datetime.date(1991, 3, 7))]

## Find all titles within the company

In [23]:
%%sql

select distinct title
from titles

7 rows affected.

[('Technique Leader',),
 ('Senior Engineer',),
 ('Staff',),
 ('Assistant Engineer',),
 ('Engineer',),
 ('Senior Staff',),
 ('Manager',)]

## Question!

Let's start with all the records

In [ ]:
%%sql

## Let's look closer at *Barton Goldhammer*

In [ ]:
%%sql

## Let's find out how *Barton Goldhammer's* salary changed, if at all

In [ ]:
%%sql

## Huh?

## A more specific version of JOIN operator

In [ ]:
%%sql

## What are the min, max, and average salaries per department?

[PostgreSQL: Documentation: 9.5: Data Type Formatting Functions](https://www.postgresql.org/docs/9.5/static/functions-formatting.html)

In [ ]:
%%sql

```
select * from
dept_emp natural join salaries
```

```
emp_no  dept_no from to salary
1       2       X    Y  10
```


```
select * from
dept_emp join salaries on dept_emp.emp_no = salaries.emp_no
```



```
emp_no   dept_no  from_1  to_1 from_2 to_2 salary
1        2        X       Y    X      Y    10
1        3        Y       X    X      Y    10
2        1        X       Y    Y      Z    12

```

## Find the salary history for Holgard Pena

In [ ]:
%%sql

## Find the job title history for Holgard Pena

In [ ]:
%%sql

## Current job title counts per department

In [ ]:
%%sql

## Average salary by job title  - based on current salary and current title

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

## Who has held the most titles?

In [ ]:
%%sql